ryanplusplus/samd21-tiny.cpp/src/start.c
/**
 * \file
 *
 * \brief gcc starttup file for SAMD21
 *
 * Copyright (c) 2013-2014 Atmel Corporation. All rights reserved.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. The name of Atmel may not be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * 4. This software may only be redistributed and used in connection with an
 *    Atmel microcontroller product.
 *
 * THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \asf_license_stop
 *
 */

#include "samd21.h"

/* Initialize segments */
extern uint32_t _sfixed;
extern uint32_t _efixed;
extern uint32_t _etext;
extern uint32_t _srelocate;
extern uint32_t _erelocate;
extern uint32_t _szero;
extern uint32_t _ezero;
extern uint32_t _sstack;
extern uint32_t _estack;

/** \cond DOXYGEN_SHOULD_SKIP_THIS */
int main(void);
/** \endcond */

void __libc_init_array(void);

/* Default empty handler */
void Dummy_Handler(void);

/* Cortex-M0+ core handlers */
void NMI_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void HardFault_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SVC_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void PendSV_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SysTick_Handler(void) __attribute__((weak, alias("Dummy_Handler")));

/* Peripherals handlers */
void PM_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SYSCTRL_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void WDT_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void RTC_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void EIC_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void NVMCTRL_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void DMAC_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void USB_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void EVSYS_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SERCOM0_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SERCOM1_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SERCOM2_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SERCOM3_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SERCOM4_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SERCOM5_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void TCC0_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void TCC1_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void TCC2_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void TC3_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void TC4_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void TC5_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void TC6_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void TC7_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void ADC_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void AC_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void DAC_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void PTC_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void I2S_Handler(void) __attribute__((weak, alias("Dummy_Handler")));

/* Exception Table */
__attribute__((section(".vectors"), used))
const DeviceVectors exception_table = {
  /* Configure Initial Stack Pointer, using linker-generated symbols */
  (void*)(&_estack),

  (void*)(uintptr_t)Reset_Handler,
  (void*)(uintptr_t)NMI_Handler,
  (void*)(uintptr_t)HardFault_Handler,
  (void*)(0UL), /* Reserved */
  (void*)(0UL), /* Reserved */
  (void*)(0UL), /* Reserved */
  (void*)(0UL), /* Reserved */
  (void*)(0UL), /* Reserved */
  (void*)(0UL), /* Reserved */
  (void*)(0UL), /* Reserved */
  (void*)(uintptr_t)SVC_Handler,
  (void*)(0UL), /* Reserved */
  (void*)(0UL), /* Reserved */
  (void*)(uintptr_t)PendSV_Handler,
  (void*)(uintptr_t)SysTick_Handler,

  /* Configurable interrupts */
  (void*)(uintptr_t)PM_Handler, /*  0 Power Manager */
  (void*)(uintptr_t)SYSCTRL_Handler, /*  1 System Control */
  (void*)(uintptr_t)WDT_Handler, /*  2 Watchdog Timer */
  (void*)(uintptr_t)RTC_Handler, /*  3 Real-Time Counter */
  (void*)(uintptr_t)EIC_Handler, /*  4 External Interrupt Controller */
  (void*)(uintptr_t)NVMCTRL_Handler, /*  5 Non-Volatile Memory Controller */
  (void*)(uintptr_t)DMAC_Handler, /*  6 Direct Memory Access Controller */
  (void*)(uintptr_t)USB_Handler, /*  7 Universal Serial Bus */
  (void*)(uintptr_t)EVSYS_Handler, /*  8 Event System Interface */
  (void*)(uintptr_t)SERCOM0_Handler, /*  9 Serial Communication Interface 0 */
  (void*)(uintptr_t)SERCOM1_Handler, /* 10 Serial Communication Interface 1 */
  (void*)(uintptr_t)SERCOM2_Handler, /* 11 Serial Communication Interface 2 */
  (void*)(uintptr_t)SERCOM3_Handler, /* 12 Serial Communication Interface 3 */
  (void*)(uintptr_t)SERCOM4_Handler, /* 13 Serial Communication Interface 4 */
  (void*)(uintptr_t)SERCOM5_Handler, /* 14 Serial Communication Interface 5 */
  (void*)(uintptr_t)TCC0_Handler, /* 15 Timer Counter Control 0 */
  (void*)(uintptr_t)TCC1_Handler, /* 16 Timer Counter Control 1 */
  (void*)(uintptr_t)TCC2_Handler, /* 17 Timer Counter Control 2 */
  (void*)(uintptr_t)TC3_Handler, /* 18 Basic Timer Counter 0 */
  (void*)(uintptr_t)TC4_Handler, /* 19 Basic Timer Counter 1 */
  (void*)(uintptr_t)TC5_Handler, /* 20 Basic Timer Counter 2 */
  (void*)(uintptr_t)TC6_Handler, /* 21 Basic Timer Counter 3 */
  (void*)(uintptr_t)TC7_Handler, /* 22 Basic Timer Counter 4 */
  (void*)(uintptr_t)ADC_Handler, /* 23 Analog Digital Converter */
  (void*)(uintptr_t)AC_Handler, /* 24 Analog Comparators */
  (void*)(uintptr_t)DAC_Handler, /* 25 Digital Analog Converter */
  (void*)(uintptr_t)PTC_Handler, /* 26 Peripheral Touch Controller */
  (void*)(uintptr_t)I2S_Handler, /* 27 Inter-IC Sound Interface */
  (void*)(0UL) /* Reserved */
};

/**
 * \brief This is the code that gets called on processor reset.
 * To initialize the device, and call the main() routine.
 */
void Reset_Handler(void)
{
  uint32_t *pSrc, *pDest;

  /* Initialize the relocate segment */
  pSrc = &_etext;
  pDest = &_srelocate;

  if(pSrc != pDest) {
    for(; pDest < &_erelocate;) {
      *pDest++ = *pSrc++;
    }
  }

  /* Clear the zero segment */
  for(pDest = &_szero; pDest < &_ezero;) {
    *pDest++ = 0;
  }

  /* Set the vector table base address */
  pSrc = (uint32_t*)&_sfixed;
  SCB->VTOR = ((uint32_t)pSrc & SCB_VTOR_TBLOFF_Msk);

  /* Branch to main function */
  main();

  /* Infinite loop */
  while(1)
    ;
}

/**
 * \brief Default interrupt handler for unused IRQs.
 */
void Dummy_Handler(void)
{
  while(1) {
  }
}
